# RebarCurvesData Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarCurvesData Methods
RebarCurvesData Class See Also
---
The RebarCurvesData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddBarGeometry(IList<(Of <<'(Curve>)>>)) | Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |
| AddBarGeometry(CurveLoop) | Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |
| CanAddBarGeometry | If the layout rule is Singe or FixedNumber or NumberWithSpacing this function will return true if getNumberOfBarGeometry() is less getBarsNumber(), false otherwise.If the layout rule is MaximumSpacing or MinimumClearSpacing this function will return always true. |
| ClearAllAddedBarGeometry | This function will remove all bars geometry that were added by calling AddBarGeometry(). |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetAddedBarGeometry | Gets the added curves that will represent the bar at index barIndex. |
| GetDistributionPath | Gets the distribution path currently stored in the rebar. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetNumberOfBarGeometry | Gets the number of Bar Geometry that were added. |
| GetRebarUpdateCurvesData | Gets a class that contains information used as input and output for rebar free form calculation. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetDistributionPath | Sets a new distribution path to be applied to the rebar. This information is set to the rebar after the API execution is finished successfully. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
RebarCurvesData Class
Autodesk.Revit.DB.Structure Namespace